



OSPF Working Group                                           J. Tantsura
Internet-Draft                                            Nuage Networks
Intended status: Standards Track                             U. Chunduri
Expires: November 18, 2018                           Huawei Technologies
                                                               S. Aldrin
                                                             Google, Inc
                                                               P. Psenak
                                                           Cisco Systems
                                                            May 17, 2018


              Signaling MSD (Maximum SID Depth) using OSPF
                 draft-ietf-ospf-segment-routing-msd-13

Abstract

   This document defines a way for an OSPF Router to advertise multiple
   types of supported Maximum SID Depths (MSDs) at node and/or link
   granularity.  Such advertisements allow entities (e.g., centralized
   controllers) to determine whether a particular SID stack can be
   supported in a given network.  This document defines only one type of
   MSD, but defines an encoding that can support other MSD types.  Here
   the term OSPF means both OSPFv2 and OSPFv3.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on November 18, 2018.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Tantsura, et al.        Expires November 18, 2018               [Page 1]

Internet-Draft                                                  May 2018


   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Conventions used in this document . . . . . . . . . . . .   3
       1.1.1.  Terminology . . . . . . . . . . . . . . . . . . . . .   3
     1.2.  Requirements Language . . . . . . . . . . . . . . . . . .   4
   2.  Node MSD Advertisement  . . . . . . . . . . . . . . . . . . .   4
   3.  Link MSD sub-TLV  . . . . . . . . . . . . . . . . . . . . . .   5
   4.  Using Node and Link MSD Advertisements  . . . . . . . . . . .   6
   5.  Base MPLS Imposition MSD  . . . . . . . . . . . . . . . . . .   6
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .   7
   8.  Contributors  . . . . . . . . . . . . . . . . . . . . . . . .   7
   9.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   7
   10. References  . . . . . . . . . . . . . . . . . . . . . . . . .   7
     10.1.  Normative References . . . . . . . . . . . . . . . . . .   8
     10.2.  Informative References . . . . . . . . . . . . . . . . .   8
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   9

1.  Introduction

   When Segment Routing(SR) paths are computed by a centralized
   controller, it is critical that the controller learns the Maximum SID
   Depth(MSD) that can be imposed at each node/link on a given SR path
   to insure that the SID stack depth of a computed path doesn't exceed
   the number of SIDs the node is capable of imposing.

   The PCEP SR extensions draft [I-D.ietf-pce-segment-routing] signals
   MSD in SR PCE Capability TLV and METRIC Object.  However, if PCEP is
   not supported/configured on the head-end of an SR tunnel or a
   Binding-SID anchor node and controller do not participate in IGP
   routing, it has no way to learn the MSD of nodes and links.  BGP-LS
   [RFC7752] defines a way to expose topology and associated attributes
   and capabilities of the nodes in that topology to a centralized
   controller.  MSD signaling by BGP-LS has been defined in
   [I-D.ietf-idr-bgp-ls-segment-routing-msd].  Typically, BGP-LS is
   configured on a small number of nodes that do not necessarily act as
   head-ends.  In order for BGP-LS to signal MSD for all the nodes and
   links in the network MSD is relevant, MSD capabilites should be
   advertised by every OSPF router in the network.



Tantsura, et al.        Expires November 18, 2018               [Page 2]

Internet-Draft                                                  May 2018


   Other types of MSD are known to be useful.  For example,
   [I-D.ietf-ospf-mpls-elc] defines Readable Label Depth Capability
   (RLDC) that is used by a head-end to insert an Entropy Label (EL) at
   a depth that can be read by transit nodes.

   This document defines an extension to OSPF used to advertise one or
   more types of MSD at node and/or link granularity.  It also defines
   the Base MPLS Imposition MSD type.  In the future it is expected,
   that new MSD types will be defined to signal additional capabilities
   e.g., entropy labels, SIDs that can be imposed through recirculation,
   or SIDs associated with another dataplane e.g., IPv6.  Although MSD
   advertisements are associated with Segment Routing, the
   advertisements MAY be present even if Segment Routing itself is not
   enabled.

1.1.  Conventions used in this document

1.1.1.  Terminology

   This memo makes use of the terms defined in [RFC7770]

   BGP-LS: Distribution of Link-State and TE Information using Border
   Gateway Protocol

   BMI: Base MPLS Imposition is the number of MPLS labels that can be
   imposed inclusive of all service/transport/special labels

   OSPF: Open Shortest Path First

   MSD: Maximum SID Depth - the number of SIDs a node or one of its
   links can support

   PCC: Path Computation Client

   PCE: Path Computation Element

   PCEP: Path Computation Element Protocol

   SR: Segment Routing

   SID: Segment Identifier

   LSA: Link state advertisement

   RI: OSPF Router Information LSA






Tantsura, et al.        Expires November 18, 2018               [Page 3]

Internet-Draft                                                  May 2018


1.2.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in
   BCP14 [RFC2119], [RFC8174] when, and only when they appear in all
   capitals, as shown here .

2.  Node MSD Advertisement

   The node MSD TLV within the body of the OSPF RI Opaque LSA is defined
   to carry the provisioned SID depth of the router originating the RI
   LSA.  Node MSD is the smallest MSD supported by the node on the set
   of interfaces configured for use by the advertising IGP instance.
   MSD values may be learned via a hardware API or may be provisioned..

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1

       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |    Type                       |         Length                |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |         MSD Type and Value ...
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ ...


                          Figure 1: Node MSD TLV

   The Type: TBD1

   Length: variable (minimum of 2, multiple of 2 octets) and represents
   the total length of value field.

   Value: consists of one or more pairs of a 1 octet MSD-type and 1
   octet MSD-Value.

   MSD-Type: one of the values defined in the MSD Types registry defined
   in [I-D.ietf-isis-segment-routing-msd].

   MSD-Value: a number in the range of 0-255.  For all MSD-Types, 0
   represents lack of the ability to impose MSD stack of any depth; any
   other value represents that of the node.  This value MUST represent
   the lowest value supported by any link configured for use by the
   advertising OSPF instance.

   This TLV is applicable to OSPFv2 and to OSPFv3 [RFC5838] and is
   optional.  The scope of the advertisement is specific to the
   deployment.



Tantsura, et al.        Expires November 18, 2018               [Page 4]

Internet-Draft                                                  May 2018


   When multiple Node MSD TLVs are received from a given router, the
   receiver MUST use the first occurrence of the TLV in the Router
   Information LSA.  If the Node MSD TLV appears in multiple Router
   Information LSAs that have different flooding scopes, the Node MSD
   TLV in the Router Information LSA with the area-scoped flooding scope
   MUST be used.  If the Node MSD TLV appears in multiple Router
   Information LSAs that have the same flooding scope, the Node MSD TLV
   in the Router Information (RI) LSA with the numerically smallest
   Instance ID MUST be used and subsequent instances of the Node MSD TLV
   MUST be ignored.  The RI LSA can be advertised at any of the defined
   opaque flooding scopes (link, area, or Autonomous System (AS)).  For
   the purpose of Node MSD TLV advertisement, area-scoped flooding is
   REQUIRED.

3.  Link MSD sub-TLV

   The link sub-TLV is defined to carry the MSD of the interface
   associated with the link.  MSD values may be learned via a hardware
   API or may be provisioned.

        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1

       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |    Type                       |         Length                |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |         MSD Type and Value ...
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ ...


                        Figure 2: Link MSD Sub-TLV

   Type:

   For OSPFv2, the Link level MSD value is advertised as an optional
   Sub-TLV of the OSPFv2 Extended Link TLV as defined in [RFC7684], and
   has value of TBD2.

   For OSPFv3, the Link level MSD value is advertised as an optional
   Sub-TLV of the E-Router-LSA TLV as defined in [RFC8362], and has
   value of TBD3.

   Length: variable and similar to that, defined in Section 2.

   Value: consists of one or more pairs of a 1 octet MSD-type and 1
   octet MSD-Value.





Tantsura, et al.        Expires November 18, 2018               [Page 5]

Internet-Draft                                                  May 2018


   MSD-Type: one of the values defined in the MSD Types registry defined
   in [I-D.ietf-isis-segment-routing-msd].

   MSD-Value field contains Link MSD of the router originating the
   corresponding LSA as specified for OSPFv2 and OSPFv3.  Link MSD is a
   number in the range of 0-255.  For all MSD-Types, 0 represents lack
   of the ability to impose MSD stack of any depth; any other value
   represents that of the particular link when used as an outgoing
   interface.

   Other MSD Types are reserved for future extensions.

   If this TLV is advertised multiple times in the same OSPFv2 Extended
   Link Opaque LSA, only the first instance of the TLV is used by
   receiving OSPFv2 routers.  This situation SHOULD be logged as an
   error.

   If this TLV is advertised multiple times for the same link in
   different OSPFv2 Extended Link Opaque LSAs originated by the same
   OSPFv2 router, the OSPFv2 Extended Link TLV in the OSPFv2 Extended
   Link Opaque LSA with the smallest Opaque ID is used by receiving
   OSPFv2 routers.  This situation may be logged as a warning.

4.  Using Node and Link MSD Advertisements

   When Link MSD is present for a given MSD type, the value of the Link
   MSD MUST take preference over the Node MSD.  When a Link MSD type is
   not signalled but the Node MSD type is, then the value of that Link
   MSD type MUST be considered as the corresponding Node MSD type value.
   In order to increase flooding efficiency, it is RECOMMENDED, that
   routers with homogenous link MSD values advertise just the Node MSD
   value.

   The meaning of the absence of both Node and Link MSD advertisements
   for a given MSD type is specific to the MSD type.  Generally it can
   only be inferred that the advertising node does not support
   advertisement of that MSD type.  However, in some cases the lack of
   advertisement might imply that the functionality associated with the
   MSD type is not supported.  The correct interpretation MUST be
   specified when an MSD type is defined.

5.  Base MPLS Imposition MSD

   The Base MPLS Imposition MSD (BMI-MSD) signals the total number of
   MPLS labels a node is capable of imposing, including all
   service/transport/special labels.





Tantsura, et al.        Expires November 18, 2018               [Page 6]

Internet-Draft                                                  May 2018


   Absence of BMI-MSD advertisements indicates solely that the
   advertising node does not support advertisement of this capability.
   Assignment of MSD-Type for BMI-MSD is defined in
   [I-D.ietf-isis-segment-routing-msd].

6.  IANA Considerations

   This document requests IANA to allocate TLV type (TBD1) from the OSPF
   Router Information (RI) TLVs Registry as defined by [RFC4970].  IANA
   has allocated the value 12 through the early assignment process.
   Also, this document requests IANA to allocate a sub-TLV type (TBD2)
   from the OSPFv2 Extended Link TLV Sub-TLVs registry.  IANA has
   allocated the the value 6 through the early assignment process.
   Finally, this document requests IANA to allocate a sub-TLV type
   (TBD3) from the OSPFv3 Extended-LSA Sub-TLV registry.

7.  Security Considerations

   Security concerns for OSPF are addressed in [RFC7474].  Further
   security analysis for OSPF protocol is done in [RFC6863] including
   analysis of both the above documents.  Security considerations, as
   specified by [RFC7770], [RFC7684] and [RFC8362] are applicable to
   this document.

   Advertisement of an incorrect MSD value may result: in a path
   computation failing and the service unavailable or instantiation of a
   path that can't be supported by the head-end (the node performing the
   imposition).

8.  Contributors

   The following people contributed to this document:

   Les Ginsberg

   Email: ginsberg@cisco.com

9.  Acknowledgements

   The authors would like to thank Acee Lindem, Ketan Talaulikar, Tal
   Mizrahi, Stephane Litkowski and Bruno Decraene for their reviews and
   valuable comments.

10.  References







Tantsura, et al.        Expires November 18, 2018               [Page 7]

Internet-Draft                                                  May 2018


10.1.  Normative References

   [I-D.ietf-isis-segment-routing-msd]
              Tantsura, J., Chunduri, U., Aldrin, S., and L. Ginsberg,
              "Signaling MSD (Maximum SID Depth) using IS-IS", draft-
              ietf-isis-segment-routing-msd-12 (work in progress), May
              2018.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC4970]  Lindem, A., Ed., Shen, N., Vasseur, JP., Aggarwal, R., and
              S. Shaffer, "Extensions to OSPF for Advertising Optional
              Router Capabilities", RFC 4970, DOI 10.17487/RFC4970, July
              2007, <https://www.rfc-editor.org/info/rfc4970>.

   [RFC7474]  Bhatia, M., Hartman, S., Zhang, D., and A. Lindem, Ed.,
              "Security Extension for OSPFv2 When Using Manual Key
              Management", RFC 7474, DOI 10.17487/RFC7474, April 2015,
              <https://www.rfc-editor.org/info/rfc7474>.

   [RFC7684]  Psenak, P., Gredler, H., Shakir, R., Henderickx, W.,
              Tantsura, J., and A. Lindem, "OSPFv2 Prefix/Link Attribute
              Advertisement", RFC 7684, DOI 10.17487/RFC7684, November
              2015, <https://www.rfc-editor.org/info/rfc7684>.

   [RFC7770]  Lindem, A., Ed., Shen, N., Vasseur, JP., Aggarwal, R., and
              S. Shaffer, "Extensions to OSPF for Advertising Optional
              Router Capabilities", RFC 7770, DOI 10.17487/RFC7770,
              February 2016, <https://www.rfc-editor.org/info/rfc7770>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8362]  Lindem, A., Roy, A., Goethals, D., Reddy Vallem, V., and
              F. Baker, "OSPFv3 Link State Advertisement (LSA)
              Extensibility", RFC 8362, DOI 10.17487/RFC8362, April
              2018, <https://www.rfc-editor.org/info/rfc8362>.

10.2.  Informative References








Tantsura, et al.        Expires November 18, 2018               [Page 8]

Internet-Draft                                                  May 2018


   [I-D.ietf-idr-bgp-ls-segment-routing-msd]
              Tantsura, J., Chunduri, U., Mirsky, G., and S. Sivabalan,
              "Signaling Maximum SID Depth using Border Gateway Protocol
              Link-State", draft-ietf-idr-bgp-ls-segment-routing-msd-01
              (work in progress), October 2017.

   [I-D.ietf-ospf-mpls-elc]
              Xu, X., Kini, S., Sivabalan, S., Filsfils, C., and S.
              Litkowski, "Signaling Entropy Label Capability and
              Readable Label-stack Depth Using OSPF", draft-ietf-ospf-
              mpls-elc-05 (work in progress), January 2018.

   [I-D.ietf-pce-segment-routing]
              Sivabalan, S., Filsfils, C., Tantsura, J., Henderickx, W.,
              and J. Hardwick, "PCEP Extensions for Segment Routing",
              draft-ietf-pce-segment-routing-11 (work in progress),
              November 2017.

   [RFC5838]  Lindem, A., Ed., Mirtorabi, S., Roy, A., Barnes, M., and
              R. Aggarwal, "Support of Address Families in OSPFv3",
              RFC 5838, DOI 10.17487/RFC5838, April 2010,
              <https://www.rfc-editor.org/info/rfc5838>.

   [RFC6863]  Hartman, S. and D. Zhang, "Analysis of OSPF Security
              According to the Keying and Authentication for Routing
              Protocols (KARP) Design Guide", RFC 6863,
              DOI 10.17487/RFC6863, March 2013,
              <https://www.rfc-editor.org/info/rfc6863>.

   [RFC7752]  Gredler, H., Ed., Medved, J., Previdi, S., Farrel, A., and
              S. Ray, "North-Bound Distribution of Link-State and
              Traffic Engineering (TE) Information Using BGP", RFC 7752,
              DOI 10.17487/RFC7752, March 2016,
              <https://www.rfc-editor.org/info/rfc7752>.

   [RFC8126]  Cotton, M., Leiba, B., and T. Narten, "Guidelines for
              Writing an IANA Considerations Section in RFCs", BCP 26,
              RFC 8126, DOI 10.17487/RFC8126, June 2017,
              <https://www.rfc-editor.org/info/rfc8126>.

Authors' Addresses

   Jeff Tantsura
   Nuage Networks

   Email: jefftant.ietf@gmail.com





Tantsura, et al.        Expires November 18, 2018               [Page 9]

Internet-Draft                                                  May 2018


   Uma Chunduri
   Huawei Technologies

   Email: uma.chunduri@huawei.com


   Sam Aldrin
   Google, Inc

   Email: aldrin.ietf@gmail.com


   Peter Psenak
   Cisco Systems

   Email: ppsenak@cisco.com



































Tantsura, et al.        Expires November 18, 2018              [Page 10]
